Merge pull request #2 from cyber-pnl/feat/dr-workload-containerization
Feat/dr workload containerization
